SoapTemplates/New.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<s:Body>
<m:putObjects xmlns:m="http://www.ricoh.co.jp/xmlns/soap/rdh/udirectory">
<sessionId></sessionId>
<objectClass>entry</objectClass>
<parentObjectId></parentObjectId>
<propListList xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:itt="http://www.ricoh.co.jp/xmlns/schema/rdh/commontypes" xsi:type="soap-enc:Array" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:t="http://www.ricoh.co.jp/xmlns/schema/rdh/commontypes" xsi:arrayType="">
<item xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:itt="http://www.ricoh.co.jp/xmlns/schema/rdh/commontypes" xsi:type="soap-enc:Array" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:t="http://www.ricoh.co.jp/xmlns/schema/rdh/commontypes" xsi:arrayType="itt:property[17]">
<item>
<propName>entryType</propName>
<propVal></propVal>
</item>
<item>
<propName>name</propName>
<propVal></propVal>
</item>
<item>
<propName>longName</propName>
<propVal>?</propVal>
</item>
<item>
<propName>isDestination</propName>
<propVal></propVal>
</item>
<item>
<propName>isSender</propName>
<propVal></propVal>
</item>
<item>
<propName>mail:</propName>
<propVal></propVal>
</item>
<item>
<propName>mail:address</propName>
<propVal></propVal>
</item>
<item>
<propName>fax:</propName>
<propVal></propVal>
</item>
<item>
<propName>fax:number</propName>
<propVal></propVal>
</item>
<item>
<propName>remoteFolder:</propName>
<propVal></propVal>
</item>
<item>
<propName>remoteFolder:type</propName>
<propVal></propVal>
</item>
<item>
<propName>remoteFolder:serverName</propName>
<propVal></propVal>
</item>
<item>
<propName>remoteFolder:port</propName>
<propVal></propVal>
</item>
<item>
<propName>remoteFolder:path</propName>
<propVal></propVal>
</item>
<item>
<propName>remoteFolder:accountName</propName>
<propVal></propVal>
</item>
<item>
<propName>remoteFolder:password</propName>
<propVal></propVal>
</item>
<item>
<propName>remoteFolder:passwordEncoding</propName>
<propVal></propVal>
</item>
</item>
</propListList>
</m:putObjects>
</s:Body>
</s:Envelope>